Heltec-Aaron-Lee/WiFi_Kit_series/esp32/boards.txt
wireless_stick.menu.LORAWAN_REGION.0=REGION_EU868
wireless_stick.menu.LORAWAN_REGION.0.build.band=REGION_EU868
wireless_stick.menu.LORAWAN_REGION.1=REGION_EU433
wireless_stick.menu.LORAWAN_REGION.1.build.band=REGION_EU433
wireless_stick.menu.LORAWAN_REGION.2=REGION_CN470
wireless_stick.menu.LORAWAN_REGION.2.build.band=REGION_CN470
wireless_stick.menu.LORAWAN_REGION.3=REGION_US915
wireless_stick.menu.LORAWAN_REGION.3.build.band=REGION_US915
wireless_stick.menu.LORAWAN_REGION.4=REGION_AU915
wireless_stick.menu.LORAWAN_REGION.4.build.band=REGION_AU915
wireless_stick.menu.LORAWAN_REGION.5=REGION_CN779
wireless_stick.menu.LORAWAN_REGION.5.build.band=REGION_CN779
wireless_stick.menu.LORAWAN_REGION.6=REGION_AS923
wireless_stick.menu.LORAWAN_REGION.6.build.band=REGION_AS923
wireless_stick.menu.LORAWAN_REGION.7=REGION_KR920
wireless_stick.menu.LORAWAN_REGION.7.build.band=REGION_KR920
wireless_stick.menu.LORAWAN_REGION.8=REGION_IN865
wireless_stick.menu.LORAWAN_REGION.8.build.band=REGION_IN865
wireless_stick.menu.LORAWAN_REGION.9=REGION_US915_HYBRID
wireless_stick.menu.LORAWAN_REGION.9.build.band=REGION_US915_HYBRID

wireless_stick.menu.LoRaWanDebugLevel.0=None
wireless_stick.menu.LoRaWanDebugLevel.0.build.LoRaWanDebugLevel=0
wireless_stick.menu.LoRaWanDebugLevel.1=Freq
wireless_stick.menu.LoRaWanDebugLevel.1.build.LoRaWanDebugLevel=1
wireless_stick.menu.LoRaWanDebugLevel.2=Freq && DIO
wireless_stick.menu.LoRaWanDebugLevel.2.build.LoRaWanDebugLevel=2
wireless_stick.menu.LoRaWanDebugLevel.3=Freq && DIO && PW
wireless_stick.menu.LoRaWanDebugLevel.3.build.LoRaWanDebugLevel=3
##############################################################

wireless_stick_lite.name=Wireless Stick Lite

wireless_stick_lite.upload.tool=esptool_py
wireless_stick_lite.upload.maximum_size=1310720
wireless_stick_lite.upload.maximum_data_size=327680
wireless_stick_lite.upload.wait_for_upload_port=true

wireless_stick_lite.serial.disableDTR=true
wireless_stick_lite.serial.disableRTS=true

wireless_stick_lite.build.mcu=esp32
wireless_stick_lite.build.core=esp32
wireless_stick_lite.build.variant=wireless_stick_lite
wireless_stick_lite.build.board=WIRELESS_STICK_LITE

wireless_stick_lite.build.f_cpu=240000000L
wireless_stick_lite.build.flash_size=4MB
wireless_stick_lite.build.flash_freq=80m
wireless_stick_lite.build.flash_mode=dio
wireless_stick_lite.build.boot=dio
wireless_stick_lite.build.partitions=default
wireless_stick_lite.build.defines=

# wireless_stick_lite.menu.PSRAM.disabled=Disabled
# wireless_stick_lite.menu.PSRAM.disabled.build.defines=
# wireless_stick_lite.menu.PSRAM.enabled=Enabled
# wireless_stick_lite.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM -mfix-esp32-psram-cache-issue

wireless_stick_lite.menu.CPUFreq.240=240MHz (WiFi/BT)
wireless_stick_lite.menu.CPUFreq.240.build.f_cpu=240000000L
wireless_stick_lite.menu.CPUFreq.160=160MHz (WiFi/BT)
wireless_stick_lite.menu.CPUFreq.160.build.f_cpu=160000000L
wireless_stick_lite.menu.CPUFreq.80=80MHz (WiFi/BT)
wireless_stick_lite.menu.CPUFreq.80.build.f_cpu=80000000L

wireless_stick_lite.menu.UploadSpeed.921600=921600
wireless_stick_lite.menu.UploadSpeed.921600.upload.speed=921600
wireless_stick_lite.menu.UploadSpeed.115200=115200
wireless_stick_lite.menu.UploadSpeed.115200.upload.speed=115200
wireless_stick_lite.menu.UploadSpeed.256000.windows=256000
wireless_stick_lite.menu.UploadSpeed.256000.upload.speed=256000
wireless_stick_lite.menu.UploadSpeed.230400.windows.upload.speed=256000
wireless_stick_lite.menu.UploadSpeed.230400=230400
wireless_stick_lite.menu.UploadSpeed.230400.upload.speed=230400
wireless_stick_lite.menu.UploadSpeed.460800.linux=460800
wireless_stick_lite.menu.UploadSpeed.460800.macosx=460800
wireless_stick_lite.menu.UploadSpeed.460800.upload.speed=460800
wireless_stick_lite.menu.UploadSpeed.512000.windows=512000
wireless_stick_lite.menu.UploadSpeed.512000.upload.speed=512000

wireless_stick_lite.menu.DebugLevel.none=None
wireless_stick_lite.menu.DebugLevel.none.build.code_debug=0
wireless_stick_lite.menu.DebugLevel.error=Error
wireless_stick_lite.menu.DebugLevel.error.build.code_debug=1
wireless_stick_lite.menu.DebugLevel.warn=Warn
wireless_stick_lite.menu.DebugLevel.warn.build.code_debug=2
wireless_stick_lite.menu.DebugLevel.info=Info
wireless_stick_lite.menu.DebugLevel.info.build.code_debug=3
wireless_stick_lite.menu.DebugLevel.debug=Debug
wireless_stick_lite.menu.DebugLevel.debug.build.code_debug=4
wireless_stick_lite.menu.DebugLevel.verbose=Verbose
wireless_stick_lite.menu.DebugLevel.verbose.build.code_debug=5

wireless_stick_lite.menu.LORAWAN_REGION.0=REGION_EU868
wireless_stick_lite.menu.LORAWAN_REGION.0.build.band=REGION_EU868
wireless_stick_lite.menu.LORAWAN_REGION.1=REGION_EU433
wireless_stick_lite.menu.LORAWAN_REGION.1.build.band=REGION_EU433
wireless_stick_lite.menu.LORAWAN_REGION.2=REGION_CN470
wireless_stick_lite.menu.LORAWAN_REGION.2.build.band=REGION_CN470
wireless_stick_lite.menu.LORAWAN_REGION.3=REGION_US915
wireless_stick_lite.menu.LORAWAN_REGION.3.build.band=REGION_US915
wireless_stick_lite.menu.LORAWAN_REGION.4=REGION_AU915
wireless_stick_lite.menu.LORAWAN_REGION.4.build.band=REGION_AU915
wireless_stick_lite.menu.LORAWAN_REGION.5=REGION_CN779
wireless_stick_lite.menu.LORAWAN_REGION.5.build.band=REGION_CN779
wireless_stick_lite.menu.LORAWAN_REGION.6=REGION_AS923
wireless_stick_lite.menu.LORAWAN_REGION.6.build.band=REGION_AS923
wireless_stick_lite.menu.LORAWAN_REGION.7=REGION_KR920
wireless_stick_lite.menu.LORAWAN_REGION.7.build.band=REGION_KR920
wireless_stick_lite.menu.LORAWAN_REGION.8=REGION_IN865
wireless_stick_lite.menu.LORAWAN_REGION.8.build.band=REGION_IN865
wireless_stick_lite.menu.LORAWAN_REGION.9=REGION_US915_HYBRID
wireless_stick_lite.menu.LORAWAN_REGION.9.build.band=REGION_US915_HYBRID

wireless_stick_lite.menu.LoRaWanDebugLevel.0=None
wireless_stick_lite.menu.LoRaWanDebugLevel.0.build.LoRaWanDebugLevel=0
wireless_stick_lite.menu.LoRaWanDebugLevel.1=Freq
wireless_stick_lite.menu.LoRaWanDebugLevel.1.build.LoRaWanDebugLevel=1
wireless_stick_lite.menu.LoRaWanDebugLevel.2=Freq && DIO
wireless_stick_lite.menu.LoRaWanDebugLevel.2.build.LoRaWanDebugLevel=2
wireless_stick_lite.menu.LoRaWanDebugLevel.3=Freq && DIO && PW
wireless_stick_lite.menu.LoRaWanDebugLevel.3.build.LoRaWanDebugLevel=3
##############################################################

